"""【程序12】
题目：企业发放的奖金根据利润提成。
利润(I)低于或等于10万元时，奖金可提10%；
利润高于10万元，低于20万元时，低于10万元的部分按10%提成，高于10万元的部分，可可提成7.5%；
20万到40万之间时，高于20万元的部分，可提成5%；
40万到60万之间时高于40万元的部分，可提成 3%；
60万到100万之间时，高于60万元的部分，可提成1.5%，
高于100万元时，超过100万元的部分按1%提成，从键盘输入当月利润I，求应发放奖金总数？
1.程序分析：请利用数轴来分界，定位。注意定义时需把奖金定义成长整型。  """

def profit(num):
    if num <= 100000:
        bonus = num * 0.1
    elif 100000 < num <= 200000:
        bonus = 100000 * 0.1 + (num - 100000) * 0.075
    elif 200000 < num <= 400000:
        bonus = 100000 * 0.1 + 100000 * 0.075 + (num - 200000) * 0.05
    elif 400000 < num <= 600000:
        bonus = 100000 * 0.1 + 100000 * 0.075 + 200000 * 0.05 + (num - 400000) * 0.03
    elif 600000 < num <= 1000000:
        bonus = (100000*0.1 + 100000*0.075 + 200000*0.05 + 200000*0.03) + (num - 600000) * 0.015
    else:  # num > 1000000
        bonus = (100000*0.1 + 100000*0.075 + 200000*0.05 + 200000*0.03 + 400000*0.015) + (num - 1000000) * 0.01
    return bonus

n = float(input("输入利润："))
print(profit(n))